-- MySQL dump 10.13  Distrib 5.5.47, for debian-linux-gnu (x86_64)
--
-- Host: localhost    Database: wx_public
-- ------------------------------------------------------
-- Server version	5.5.47-0ubuntu0.14.04.1

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `wx_public_data`
--

DROP TABLE IF EXISTS `wx_public_data`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `wx_public_data` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '自增id',
  `orderid` varchar(55) NOT NULL COMMENT '订单id',
  `product` varchar(55) NOT NULL COMMENT '商品名称',
  `mun` tinyint(5) NOT NULL COMMENT '数量',
  `name` varchar(55) NOT NULL COMMENT '收货人姓名',
  `mob` varchar(16) NOT NULL COMMENT '收货人电话',
  `province` varchar(55) NOT NULL COMMENT '收货人地址  省',
  `city` varchar(55) NOT NULL COMMENT '收货人地址  市',
  `area` varchar(55) NOT NULL COMMENT '收货人地址  区',
  `address` varchar(55) NOT NULL COMMENT '详细地址',
  `zfbprice` tinyint(11) NOT NULL COMMENT '快递费用',
  `price` tinyint(11) NOT NULL COMMENT '商品价格',
  `cod` varchar(55) NOT NULL COMMENT '付款方式',
  `guest` varchar(55) NOT NULL COMMENT '用户留言',
  `express_name` varchar(55) DEFAULT NULL,
  `express_no` varchar(55) DEFAULT NULL COMMENT '快递单号',
  `status` tinyint(5) NOT NULL DEFAULT '0' COMMENT '状态， 0 未发货      1 发货',
  `addtime` int(11) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=33 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `wx_public_data`
--

LOCK TABLES `wx_public_data` WRITE;
/*!40000 ALTER TABLE `wx_public_data` DISABLE KEYS */;
INSERT INTO `wx_public_data` VALUES (1,'no.2016421225218258','茅台好酒免费领',1,'徐萍','2147483647','北京市','市辖区','海淀区','3123123',23,23,'','3123','312312','3123123',1,1461252219),(2,'no.2016421225218258','茅台好酒免费领',1,'徐萍','2147483647','北京市','市辖区','海淀区','3123123',23,23,'','3123','312312','3123123',1,1461252219),(3,'no.2016421225218258','茅台好酒免费领',1,'徐萍','2147483647','北京市','市辖区','海淀区','3123123',23,23,'cod','3123','312312','3123123',1,1461252291),(4,'no.2016421225218258','茅台好酒免费领',1,'徐萍','2147483647','北京市','市辖区','海淀区','3123123',23,23,'cod','3123','312312','3123123',1,1461252299),(5,'no.2016421225218258','茅台好酒免费',1,'徐萍','2147483647','北京市','市辖区','海淀区','3123123',23,23,'cod','3123','312312','3123123',1,1461252301),(6,'no.2016421225218258','茅台好酒免费',1,'徐萍','2147483647','北京市','市辖区','海淀区','3123123',23,23,'cod','3123','312312','3123123',1,1461252303),(7,'no.2016421225218258','茅台好酒免费',1,'徐萍','2147483647','北京市','市辖区','海淀区','3123123',23,23,'cod','3123','312312','3123123',1,1461252417),(8,'no.201642222187392','茅台好酒免费',1,'测试中','2147483647','湖北省','恩施土家族苗族自治州','巴东县','你好测试',23,23,'cod','恶趣味股奇偶','3123123','11111111111',1,1461335131),(9,'no.201642222264061','茅台好酒免费',1,'小徐','15601732706','湖北省','随州市','曾都区','fewfwa',23,23,'cod','fwefewaf',NULL,NULL,0,1461335194),(10,'no.20164230737496','茅台好酒免费领！23元',1,'李熙宇','15051500937','河北省','邢台市','邢台县','北七家镇',23,23,'cod','jkjkhkh','顺风快递','512565',1,1461341310),(11,'no.201642312220527','茅台好酒免费领！23元',1,'李熙宇','15051500937','河南省','商丘市','梁园区','测试啊测试',23,23,'cod','',NULL,NULL,0,1461345769),(12,'no.2016424222831264','茅台好酒免费领！23元',1,'李熙宇','17090091274','内蒙古自治区','巴彦淖尔市','乌拉特中旗','天安门',23,23,'cod','周日在家','天天快递','14856656446',1,1461508154),(13,'no.2016424223216932','茅台好酒免费领！23元',1,'徐萍','15601732706','北京市','市辖区','东城区','哟哦健健康康',23,23,'cod','健健康康快乐',NULL,NULL,0,1461508450),(14,'no.201642422395512','茅台好酒免费领！23元',1,'嘴里','13053137953','黑龙江省','哈尔滨市','平房区','健健康康',23,23,'cod','',NULL,NULL,0,1461508779),(15,'no.2016424224235636','茅台好酒免费领！23元',1,'自己了','15601732706','湖北省','武汉市','汉南区','可口可乐',23,23,'cod','啦啦啦',NULL,NULL,0,1461508986),(16,'no.2016424224235636','茅台好酒免费领！23元',1,'自己了','15601732706','湖北省','武汉市','汉南区','可口可乐',23,23,'cod','啦啦啦',NULL,NULL,0,1461508998),(17,'no.2016424224756071','茅台好酒免费领！23元',1,'李熙宇','15051500937','内蒙古自治区','鄂尔多斯市','鄂托克旗','金龙大厦',23,23,'cod','明天能到货吗？',NULL,NULL,0,1461509320),(18,'no.2016424224756071','茅台好酒免费领！23元',1,'李熙宇','15051500937','内蒙古自治区','鄂尔多斯市','鄂托克旗','金龙大厦',23,23,'cod','明天能到货吗？',NULL,NULL,0,1461509333),(19,'no.2016424224756071','茅台好酒免费领！23元',1,'李熙宇','15051500937','内蒙古自治区','鄂尔多斯市','鄂托克旗','金龙大厦',23,23,'cod','明天能到货吗？',NULL,NULL,0,1461509334),(20,'no.2016424224849351','茅台好酒免费领！23元',1,'徐萍','13053137952','山西省','太原市','杏花岭区','爸爸',23,23,'cod','',NULL,NULL,0,1461509409),(21,'no.2016424224849351','茅台好酒免费领！23元',1,'徐萍','13053137952','山西省','太原市','杏花岭区','爸爸',23,23,'cod','',NULL,NULL,0,1461509418),(22,'no.2016424224849351','茅台好酒免费领！23元',1,'徐萍','13053137952','山西省','太原市','杏花岭区','爸爸',23,23,'cod','',NULL,NULL,0,1461509418),(23,'no.2016424225933380','茅台好酒免费领！23元',1,'测试','13865253579','浙江省','杭州市','拱墅区','测试',23,23,'cod','啦啦啦',NULL,NULL,0,1461510012),(24,'no.2016424225933380','茅台好酒免费领！23元',1,'测试','13865253579','浙江省','杭州市','拱墅区','测试',23,23,'cod','啦啦啦',NULL,NULL,0,1461510029),(25,'no.2016424225933380','茅台好酒免费领！23元',1,'测试','13865253579','浙江省','杭州市','拱墅区','测试',23,23,'cod','啦啦啦',NULL,NULL,0,1461510030),(26,'no.571ce1007f48e3549','茅台好酒免费领！23元',1,'测试重复','13053137954','上海市','市辖区','黄浦区','健健康康k l',23,23,'cod','',NULL,NULL,0,1461510400),(27,'no.571ce11c547413199','茅台好酒免费领！23元',1,'测试重复','13053137954','上海市','市辖区','黄浦区','健健康康k l',23,23,'cod','',NULL,NULL,0,1461510428),(28,'no.571ce11cbd1071782','茅台好酒免费领！23元',1,'测试重复','13053137954','上海市','市辖区','黄浦区','健健康康k l',23,23,'cod','',NULL,NULL,0,1461510428),(29,'no.2016424231254053','茅台好酒免费领！23元',1,'哦咯哦','13053137955','黑龙江省','哈尔滨市','松北区','可口可乐',23,23,'cod','',NULL,NULL,0,1461510808),(30,'no.2016424231420961','茅台好酒免费领！23元',1,'数据不重复','13053137956','上海市','市辖区','闸北区','考虑考虑',23,23,'cod','',NULL,NULL,0,1461510885),(31,'no.2016424231642118','茅台好酒免费领！23元',1,'徐萍阿里','13053137957','辽宁省','沈阳市','铁西区','离开了',23,23,'cod','',NULL,NULL,0,1461511028),(32,'no.2016424232447992','茅台好酒免费领！23元',1,'李熙宇','17090091274','河北省','邯郸市','复兴区','我艹',23,23,'cod','while(! echo 我艹)',NULL,NULL,0,1461511706);
/*!40000 ALTER TABLE `wx_public_data` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2016-04-24 23:47:54
